NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_application.svd
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Input configuration for CH[m]</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00020000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHOPPING</name>
                <description>Enable chopping</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Chopping is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Chopping is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VREFPLPFDISABLE</name>
                <description>Disable the internal low pass filter for the reference voltage</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>The internal low pass filter for the reference voltage is disabled (reference voltage is unfiltered and has faster settling time)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>The internal low pass filter for the reference voltage is enabled (reference voltage is filtered)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HIGHSPEED</name>
                <description>Enable high speed inputs for the ADC, allowing the highest sampling bandwidth</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>High speed inputs are disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>High speed inputs are enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REFSEL</name>
                <description>Reference control</description>
                <lsb>12</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Internal 1.024 V reference</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>External reference voltage</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Vdd</name>
                    <description>Reference given at VDD</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>Enable differential mode</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SE</name>
                    <description>Single ended, PSELN will be ignored, negative input to ADC shorted to GND</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Diff</name>
                    <description>Differential</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TACQ</name>
                <description>Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is ((TACQ+1) x 125 ns)</description>
                <lsb>16</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>TCONV</name>
                <description>Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns)</description>
                <lsb>28</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIMIT</name>
            <description>Description cluster: High/low limits for event monitoring a channel</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x7FFF8000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOW</name>
                <description>Low level limit</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HIGH</name>
                <description>High level limit</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>BURST</name>
          <description>Enable burst mode</description>
          <addressOffset>0x5E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BURST</name>
              <description>Enable burst mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Burst mode is disabled (normal operation)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples and sends the average to Data RAM.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESOLUTION</name>
          <description>Resolution configuration</description>
          <addressOffset>0x5F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>Set the resolution</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8 bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10bit</name>
                  <description>10 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12bit</name>
                  <description>12 bit</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14bit</name>
                  <description>14 bit</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERSAMPLE</name>
          <description>Oversampling configuration. OVERSAMPLE should not be combined with SCAN. The RESOLUTION is applied before averaging, thus for high OVERSAMPLE a higher RESOLUTION should be used.</description>
          <addressOffset>0x5F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVERSAMPLE</name>
              <description>Oversample control</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over2x</name>
                  <description>Oversample 2x</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over4x</name>
                  <description>Oversample 4x</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over8x</name>
                  <description>Oversample 8x</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over16x</name>
                  <description>Oversample 16x</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over32x</name>
                  <description>Oversample 32x</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over64x</name>
                  <description>Oversample 64x</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over128x</name>
                  <description>Oversample 128x</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Over256x</name>
                  <description>Oversample 256x</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLERATE</name>
          <description>Controls normal or continuous sample rate</description>
          <addressOffset>0x5F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Capture and compare value. Sample rate is 16 MHz/CC</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>Select mode for sample rate control</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Task</name>
                  <description>Rate is controlled from SAMPLE task</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timers</name>
                  <description>Rate is controlled from local timer (use CC to control the rate)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RESULT</name>
          <description>RESULT EasyDMA channel</description>
          <headerStructName>SAADC_RESULT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x628</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of buffer bytes to transfer</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of buffer bytes to transfer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of buffer bytes transferred since last START, updated after the END or STOPPED events</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer bytes transferred since last START, updated after the END or STOPPED events.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTAMOUNT</name>
            <description>Number of buffer bytes transferred since last START, continuously updated</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of buffer bytes transferred since last START, continuously updated.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
