NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54ls05b_application.svd
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLatched</name>
                  <description>Criteria has not been met</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Latched</name>
                  <description>Criteria has been met</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DETECTMODE</name>
          <description>Select between default DETECT signal behavior and LDETECT mode</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DETECTMODE</name>
              <description>Select between default DETECT signal behavior and LDETECT mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>DETECT directly connected to PIN DETECT signals</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDETECT</name>
                  <description>Use the latched LDETECT behavior</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PORTCNF</name>
          <description>Unspecified</description>
          <headerStructName>GPIO_PORTCNF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x030</addressOffset>
          <register>
            <name>WEAKPU</name>
            <description>Control global weak pull-ups on the selected set of GPIO pins</description>
            <addressOffset>0x00</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PULLUP</name>
                <description>Control pull-up.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Pull-up is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PU0</name>
                    <description>Enable pull-up 0.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PU1</name>
                    <description>Enable pull-up 1.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PU2</name>
                    <description>Enable pull-up 2.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PIN_CNF[%s]</name>
          <description>Description collection: Pin n configuration of GPIO pin</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Pin direction. Same physical register as DIR register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Configure pin as an input pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Configure pin as an output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT</name>
              <description>Connect or disconnect input buffer</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Connect</name>
                  <description>Connect input buffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disconnect</name>
                  <description>Disconnect input buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULL</name>
              <description>Pull configuration</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No pull</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pulldown</name>
                  <description>Pull-down on pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pullup</name>
                  <description>Pull-up on pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE0</name>
              <description>Drive configuration for '0'</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S0</name>
                  <description>Standard '0'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H0</name>
                  <description>High drive '0'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0</name>
                  <description>Disconnect '0'(normally used for wired-or connections)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E0</name>
                  <description>Extra high drive '0'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIVE1</name>
              <description>Drive configuration for '1'</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S1</name>
                  <description>Standard '1'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H1</name>
                  <description>High drive '1'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1</name>
                  <description>Disconnect '1'(normally used for wired-or connections)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E1</name>
                  <description>Extra high drive '1'</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSE</name>
              <description>Pin sensing mechanism</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Sense for high level</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Sense for low level</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRLSEL</name>
              <description>Select which module has direct control over this pin</description>
              <lsb>28</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIO or peripherals with PSEL registers</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VPR</name>
                  <description>VPR processor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRTC</name>
                  <description>GRTC peripheral</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
